Parametric Heatsink Simulation/Linux Files/pitch_8mm_nfins_9/system/blockMeshDict
FoamFile
{
    version 2.0; format ascii;
    class dictionary; object blockMeshDict;
}

scale 1;

vertices
(
    (0.0000000e+00 0.0000000e+00 0.0000000e+00)
    (7.2500000e-03 0.0000000e+00 0.0000000e+00)
    (8.7500000e-03 0.0000000e+00 0.0000000e+00)
    (1.5250000e-02 0.0000000e+00 0.0000000e+00)
    (1.6750000e-02 0.0000000e+00 0.0000000e+00)
    (2.3250000e-02 0.0000000e+00 0.0000000e+00)
    (2.4750000e-02 0.0000000e+00 0.0000000e+00)
    (3.1250000e-02 0.0000000e+00 0.0000000e+00)
    (3.2750000e-02 0.0000000e+00 0.0000000e+00)
    (3.9250000e-02 0.0000000e+00 0.0000000e+00)
    (4.0750000e-02 0.0000000e+00 0.0000000e+00)
    (4.7250000e-02 0.0000000e+00 0.0000000e+00)
    (4.8750000e-02 0.0000000e+00 0.0000000e+00)
    (5.5250000e-02 0.0000000e+00 0.0000000e+00)
    (5.6750000e-02 0.0000000e+00 0.0000000e+00)
    (6.3250000e-02 0.0000000e+00 0.0000000e+00)
    (6.4750000e-02 0.0000000e+00 0.0000000e+00)
    (7.1250000e-02 0.0000000e+00 0.0000000e+00)
    (7.2750000e-02 0.0000000e+00 0.0000000e+00)
    (8.0000000e-02 0.0000000e+00 0.0000000e+00)
    (0.0000000e+00 5.0000000e-03 0.0000000e+00)
    (7.2500000e-03 5.0000000e-03 0.0000000e+00)
    (8.7500000e-03 5.0000000e-03 0.0000000e+00)
    (1.5250000e-02 5.0000000e-03 0.0000000e+00)
    (1.6750000e-02 5.0000000e-03 0.0000000e+00)
    (2.3250000e-02 5.0000000e-03 0.0000000e+00)
    (2.4750000e-02 5.0000000e-03 0.0000000e+00)
    (3.1250000e-02 5.0000000e-03 0.0000000e+00)
    (3.2750000e-02 5.0000000e-03 0.0000000e+00)
    (3.9250000e-02 5.0000000e-03 0.0000000e+00)
    (4.0750000e-02 5.0000000e-03 0.0000000e+00)
    (4.7250000e-02 5.0000000e-03 0.0000000e+00)
    (4.8750000e-02 5.0000000e-03 0.0000000e+00)
    (5.5250000e-02 5.0000000e-03 0.0000000e+00)
    (5.6750000e-02 5.0000000e-03 0.0000000e+00)
    (6.3250000e-02 5.0000000e-03 0.0000000e+00)
    (6.4750000e-02 5.0000000e-03 0.0000000e+00)
    (7.1250000e-02 5.0000000e-03 0.0000000e+00)
    (7.2750000e-02 5.0000000e-03 0.0000000e+00)
    (8.0000000e-02 5.0000000e-03 0.0000000e+00)
    (0.0000000e+00 4.0000000e-02 0.0000000e+00)
    (7.2500000e-03 4.0000000e-02 0.0000000e+00)
    (8.7500000e-03 4.0000000e-02 0.0000000e+00)
    (1.5250000e-02 4.0000000e-02 0.0000000e+00)
    (1.6750000e-02 4.0000000e-02 0.0000000e+00)
    (2.3250000e-02 4.0000000e-02 0.0000000e+00)
    (2.4750000e-02 4.0000000e-02 0.0000000e+00)
    (3.1250000e-02 4.0000000e-02 0.0000000e+00)
    (3.2750000e-02 4.0000000e-02 0.0000000e+00)
    (3.9250000e-02 4.0000000e-02 0.0000000e+00)
    (4.0750000e-02 4.0000000e-02 0.0000000e+00)
    (4.7250000e-02 4.0000000e-02 0.0000000e+00)
    (4.8750000e-02 4.0000000e-02 0.0000000e+00)
    (5.5250000e-02 4.0000000e-02 0.0000000e+00)
    (5.6750000e-02 4.0000000e-02 0.0000000e+00)
    (6.3250000e-02 4.0000000e-02 0.0000000e+00)
    (6.4750000e-02 4.0000000e-02 0.0000000e+00)
    (7.1250000e-02 4.0000000e-02 0.0000000e+00)
    (7.2750000e-02 4.0000000e-02 0.0000000e+00)
    (8.0000000e-02 4.0000000e-02 0.0000000e+00)
    (0.0000000e+00 8.0000000e-02 0.0000000e+00)
    (7.2500000e-03 8.0000000e-02 0.0000000e+00)
    (8.7500000e-03 8.0000000e-02 0.0000000e+00)
    (1.5250000e-02 8.0000000e-02 0.0000000e+00)
    (1.6750000e-02 8.0000000e-02 0.0000000e+00)
    (2.3250000e-02 8.0000000e-02 0.0000000e+00)
    (2.4750000e-02 8.0000000e-02 0.0000000e+00)
    (3.1250000e-02 8.0000000e-02 0.0000000e+00)
    (3.2750000e-02 8.0000000e-02 0.0000000e+00)
    (3.9250000e-02 8.0000000e-02 0.0000000e+00)
    (4.0750000e-02 8.0000000e-02 0.0000000e+00)
    (4.7250000e-02 8.0000000e-02 0.0000000e+00)
    (4.8750000e-02 8.0000000e-02 0.0000000e+00)
    (5.5250000e-02 8.0000000e-02 0.0000000e+00)
    (5.6750000e-02 8.0000000e-02 0.0000000e+00)
    (6.3250000e-02 8.0000000e-02 0.0000000e+00)
    (6.4750000e-02 8.0000000e-02 0.0000000e+00)
    (7.1250000e-02 8.0000000e-02 0.0000000e+00)
    (7.2750000e-02 8.0000000e-02 0.0000000e+00)
    (8.0000000e-02 8.0000000e-02 0.0000000e+00)
    (0.0000000e+00 0.0000000e+00 1.0500000e-01)
    (7.2500000e-03 0.0000000e+00 1.0500000e-01)
    (8.7500000e-03 0.0000000e+00 1.0500000e-01)
    (1.5250000e-02 0.0000000e+00 1.0500000e-01)
    (1.6750000e-02 0.0000000e+00 1.0500000e-01)
    (2.3250000e-02 0.0000000e+00 1.0500000e-01)
    (2.4750000e-02 0.0000000e+00 1.0500000e-01)
    (3.1250000e-02 0.0000000e+00 1.0500000e-01)
    (3.2750000e-02 0.0000000e+00 1.0500000e-01)
    (3.9250000e-02 0.0000000e+00 1.0500000e-01)
    (4.0750000e-02 0.0000000e+00 1.0500000e-01)
    (4.7250000e-02 0.0000000e+00 1.0500000e-01)
    (4.8750000e-02 0.0000000e+00 1.0500000e-01)
    (5.5250000e-02 0.0000000e+00 1.0500000e-01)
    (5.6750000e-02 0.0000000e+00 1.0500000e-01)
    (6.3250000e-02 0.0000000e+00 1.0500000e-01)
    (6.4750000e-02 0.0000000e+00 1.0500000e-01)
    (7.1250000e-02 0.0000000e+00 1.0500000e-01)
    (7.2750000e-02 0.0000000e+00 1.0500000e-01)
...
);

blocks
(
    hex (0 1 21 20 80 81 101 100) fluid (4 4 25) simpleGrading (1 1 1)
    hex (1 2 22 21 81 82 102 101) fluid (4 4 25) simpleGrading (1 1 1)
    hex (2 3 23 22 82 83 103 102) fluid (8 4 25) simpleGrading (1 1 1)
    hex (3 4 24 23 83 84 104 103) fluid (4 4 25) simpleGrading (1 1 1)
    hex (4 5 25 24 84 85 105 104) fluid (8 4 25) simpleGrading (1 1 1)
    hex (5 6 26 25 85 86 106 105) fluid (4 4 25) simpleGrading (1 1 1)
    hex (6 7 27 26 86 87 107 106) fluid (8 4 25) simpleGrading (1 1 1)
    hex (7 8 28 27 87 88 108 107) fluid (4 4 25) simpleGrading (1 1 1)
    hex (8 9 29 28 88 89 109 108) fluid (8 4 25) simpleGrading (1 1 1)
    hex (9 10 30 29 89 90 110 109) fluid (4 4 25) simpleGrading (1 1 1)
    hex (10 11 31 30 90 91 111 110) fluid (8 4 25) simpleGrading (1 1 1)
    hex (11 12 32 31 91 92 112 111) fluid (4 4 25) simpleGrading (1 1 1)
    hex (12 13 33 32 92 93 113 112) fluid (8 4 25) simpleGrading (1 1 1)
    hex (13 14 34 33 93 94 114 113) fluid (4 4 25) simpleGrading (1 1 1)
    hex (14 15 35 34 94 95 115 114) fluid (8 4 25) simpleGrading (1 1 1)
    hex (15 16 36 35 95 96 116 115) fluid (4 4 25) simpleGrading (1 1 1)
    hex (16 17 37 36 96 97 117 116) fluid (8 4 25) simpleGrading (1 1 1)
    hex (17 18 38 37 97 98 118 117) fluid (4 4 25) simpleGrading (1 1 1)
    hex (18 19 39 38 98 99 119 118) fluid (4 4 25) simpleGrading (1 1 1)
    hex (20 21 41 40 100 101 121 120) fluid (4 18 25) simpleGrading (1 1 1)
    hex (21 22 42 41 101 102 122 121) fluid (4 18 25) simpleGrading (1 1 1)
    hex (22 23 43 42 102 103 123 122) fluid (8 18 25) simpleGrading (1 1 1)
    hex (23 24 44 43 103 104 124 123) fluid (4 18 25) simpleGrading (1 1 1)
    hex (24 25 45 44 104 105 125 124) fluid (8 18 25) simpleGrading (1 1 1)
    hex (25 26 46 45 105 106 126 125) fluid (4 18 25) simpleGrading (1 1 1)
    hex (26 27 47 46 106 107 127 126) fluid (8 18 25) simpleGrading (1 1 1)
    hex (27 28 48 47 107 108 128 127) fluid (4 18 25) simpleGrading (1 1 1)
    hex (28 29 49 48 108 109 129 128) fluid (8 18 25) simpleGrading (1 1 1)
    hex (29 30 50 49 109 110 130 129) fluid (4 18 25) simpleGrading (1 1 1)
    hex (30 31 51 50 110 111 131 130) fluid (8 18 25) simpleGrading (1 1 1)
    hex (31 32 52 51 111 112 132 131) fluid (4 18 25) simpleGrading (1 1 1)
    hex (32 33 53 52 112 113 133 132) fluid (8 18 25) simpleGrading (1 1 1)
    hex (33 34 54 53 113 114 134 133) fluid (4 18 25) simpleGrading (1 1 1)
    hex (34 35 55 54 114 115 135 134) fluid (8 18 25) simpleGrading (1 1 1)
    hex (35 36 56 55 115 116 136 135) fluid (4 18 25) simpleGrading (1 1 1)
    hex (36 37 57 56 116 117 137 136) fluid (8 18 25) simpleGrading (1 1 1)
    hex (37 38 58 57 117 118 138 137) fluid (4 18 25) simpleGrading (1 1 1)
    hex (38 39 59 58 118 119 139 138) fluid (4 18 25) simpleGrading (1 1 1)
    hex (40 41 61 60 120 121 141 140) fluid (4 12 25) simpleGrading (1 1 1)
    hex (41 42 62 61 121 122 142 141) fluid (4 12 25) simpleGrading (1 1 1)
    hex (42 43 63 62 122 123 143 142) fluid (8 12 25) simpleGrading (1 1 1)
    hex (43 44 64 63 123 124 144 143) fluid (4 12 25) simpleGrading (1 1 1)
    hex (44 45 65 64 124 125 145 144) fluid (8 12 25) simpleGrading (1 1 1)
    hex (45 46 66 65 125 126 146 145) fluid (4 12 25) simpleGrading (1 1 1)
    hex (46 47 67 66 126 127 147 146) fluid (8 12 25) simpleGrading (1 1 1)
    hex (47 48 68 67 127 128 148 147) fluid (4 12 25) simpleGrading (1 1 1)
    hex (48 49 69 68 128 129 149 148) fluid (8 12 25) simpleGrading (1 1 1)
    hex (49 50 70 69 129 130 150 149) fluid (4 12 25) simpleGrading (1 1 1)
    hex (50 51 71 70 130 131 151 150) fluid (8 12 25) simpleGrading (1 1 1)
    hex (51 52 72 71 131 132 152 151) fluid (4 12 25) simpleGrading (1 1 1)
    hex (52 53 73 72 132 133 153 152) fluid (8 12 25) simpleGrading (1 1 1)
    hex (53 54 74 73 133 134 154 153) fluid (4 12 25) simpleGrading (1 1 1)
    hex (54 55 75 74 134 135 155 154) fluid (8 12 25) simpleGrading (1 1 1)
    hex (55 56 76 75 135 136 156 155) fluid (4 12 25) simpleGrading (1 1 1)
    hex (56 57 77 76 136 137 157 156) fluid (8 12 25) simpleGrading (1 1 1)
    hex (57 58 78 77 137 138 158 157) fluid (4 12 25) simpleGrading (1 1 1)
    hex (58 59 79 78 138 139 159 158) fluid (4 12 25) simpleGrading (1 1 1)
    hex (80 81 101 100 160 161 181 180) solid (4 4 40) simpleGrading (1 1 1)
    hex (81 82 102 101 161 162 182 181) solid (4 4 40) simpleGrading (1 1 1)
    hex (82 83 103 102 162 163 183 182) solid (8 4 40) simpleGrading (1 1 1)
    hex (83 84 104 103 163 164 184 183) solid (4 4 40) simpleGrading (1 1 1)
    hex (84 85 105 104 164 165 185 184) solid (8 4 40) simpleGrading (1 1 1)
    hex (85 86 106 105 165 166 186 185) solid (4 4 40) simpleGrading (1 1 1)
    hex (86 87 107 106 166 167 187 186) solid (8 4 40) simpleGrading (1 1 1)
    hex (87 88 108 107 167 168 188 187) solid (4 4 40) simpleGrading (1 1 1)
    hex (88 89 109 108 168 169 189 188) solid (8 4 40) simpleGrading (1 1 1)
    hex (89 90 110 109 169 170 190 189) solid (4 4 40) simpleGrading (1 1 1)
    hex (90 91 111 110 170 171 191 190) solid (8 4 40) simpleGrading (1 1 1)
    hex (91 92 112 111 171 172 192 191) solid (4 4 40) simpleGrading (1 1 1)
    hex (92 93 113 112 172 173 193 192) solid (8 4 40) simpleGrading (1 1 1)
    hex (93 94 114 113 173 174 194 193) solid (4 4 40) simpleGrading (1 1 1)
    hex (94 95 115 114 174 175 195 194) solid (8 4 40) simpleGrading (1 1 1)
    hex (95 96 116 115 175 176 196 195) solid (4 4 40) simpleGrading (1 1 1)
    hex (96 97 117 116 176 177 197 196) solid (8 4 40) simpleGrading (1 1 1)
    hex (97 98 118 117 177 178 198 197) solid (4 4 40) simpleGrading (1 1 1)
    hex (98 99 119 118 178 179 199 198) solid (4 4 40) simpleGrading (1 1 1)
    hex (100 101 121 120 180 181 201 200) fluid (4 18 40) simpleGrading (1 1 1)
    hex (101 102 122 121 181 182 202 201) solid (4 18 40) simpleGrading (1 1 1)
    hex (102 103 123 122 182 183 203 202) fluid (8 18 40) simpleGrading (1 1 1)
    hex (103 104 124 123 183 184 204 203) solid (4 18 40) simpleGrading (1 1 1)
    hex (104 105 125 124 184 185 205 204) fluid (8 18 40) simpleGrading (1 1 1)
    hex (105 106 126 125 185 186 206 205) solid (4 18 40) simpleGrading (1 1 1)
    hex (106 107 127 126 186 187 207 206) fluid (8 18 40) simpleGrading (1 1 1)
    hex (107 108 128 127 187 188 208 207) solid (4 18 40) simpleGrading (1 1 1)
    hex (108 109 129 128 188 189 209 208) fluid (8 18 40) simpleGrading (1 1 1)
    hex (109 110 130 129 189 190 210 209) solid (4 18 40) simpleGrading (1 1 1)
    hex (110 111 131 130 190 191 211 210) fluid (8 18 40) simpleGrading (1 1 1)
    hex (111 112 132 131 191 192 212 211) solid (4 18 40) simpleGrading (1 1 1)
    hex (112 113 133 132 192 193 213 212) fluid (8 18 40) simpleGrading (1 1 1)
    hex (113 114 134 133 193 194 214 213) solid (4 18 40) simpleGrading (1 1 1)
    hex (114 115 135 134 194 195 215 214) fluid (8 18 40) simpleGrading (1 1 1)
    hex (115 116 136 135 195 196 216 215) solid (4 18 40) simpleGrading (1 1 1)
    hex (116 117 137 136 196 197 217 216) fluid (8 18 40) simpleGrading (1 1 1)
    hex (117 118 138 137 197 198 218 217) solid (4 18 40) simpleGrading (1 1 1)
    hex (118 119 139 138 198 199 219 218) fluid (4 18 40) simpleGrading (1 1 1)
    hex (120 121 141 140 200 201 221 220) fluid (4 12 40) simpleGrading (1 1 1)
    hex (121 122 142 141 201 202 222 221) fluid (4 12 40) simpleGrading (1 1 1)
    hex (122 123 143 142 202 203 223 222) fluid (8 12 40) simpleGrading (1 1 1)
    hex (123 124 144 143 203 204 224 223) fluid (4 12 40) simpleGrading (1 1 1)
    hex (124 125 145 144 204 205 225 224) fluid (8 12 40) simpleGrading (1 1 1)
    hex (125 126 146 145 205 206 226 225) fluid (4 12 40) simpleGrading (1 1 1)
    hex (126 127 147 146 206 207 227 226) fluid (8 12 40) simpleGrading (1 1 1)
    hex (127 128 148 147 207 208 228 227) fluid (4 12 40) simpleGrading (1 1 1)
    hex (128 129 149 148 208 209 229 228) fluid (8 12 40) simpleGrading (1 1 1)
    hex (129 130 150 149 209 210 230 229) fluid (4 12 40) simpleGrading (1 1 1)
    hex (130 131 151 150 210 211 231 230) fluid (8 12 40) simpleGrading (1 1 1)
    hex (131 132 152 151 211 212 232 231) fluid (4 12 40) simpleGrading (1 1 1)
    hex (132 133 153 152 212 213 233 232) fluid (8 12 40) simpleGrading (1 1 1)
    hex (133 134 154 153 213 214 234 233) fluid (4 12 40) simpleGrading (1 1 1)
    hex (134 135 155 154 214 215 235 234) fluid (8 12 40) simpleGrading (1 1 1)
    hex (135 136 156 155 215 216 236 235) fluid (4 12 40) simpleGrading (1 1 1)
    hex (136 137 157 156 216 217 237 236) fluid (8 12 40) simpleGrading (1 1 1)
    hex (137 138 158 157 217 218 238 237) fluid (4 12 40) simpleGrading (1 1 1)
    hex (138 139 159 158 218 219 239 238) fluid (4 12 40) simpleGrading (1 1 1)
    hex (160 161 181 180 240 241 261 260) fluid (4 4 25) simpleGrading (1 1 1)
    hex (161 162 182 181 241 242 262 261) fluid (4 4 25) simpleGrading (1 1 1)
    hex (162 163 183 182 242 243 263 262) fluid (8 4 25) simpleGrading (1 1 1)
    hex (163 164 184 183 243 244 264 263) fluid (4 4 25) simpleGrading (1 1 1)
    hex (164 165 185 184 244 245 265 264) fluid (8 4 25) simpleGrading (1 1 1)
    hex (165 166 186 185 245 246 266 265) fluid (4 4 25) simpleGrading (1 1 1)
    hex (166 167 187 186 246 247 267 266) fluid (8 4 25) simpleGrading (1 1 1)
    hex (167 168 188 187 247 248 268 267) fluid (4 4 25) simpleGrading (1 1 1)
    hex (168 169 189 188 248 249 269 268) fluid (8 4 25) simpleGrading (1 1 1)
    hex (169 170 190 189 249 250 270 269) fluid (4 4 25) simpleGrading (1 1 1)
    hex (170 171 191 190 250 251 271 270) fluid (8 4 25) simpleGrading (1 1 1)
    hex (171 172 192 191 251 252 272 271) fluid (4 4 25) simpleGrading (1 1 1)
    hex (172 173 193 192 252 253 273 272) fluid (8 4 25) simpleGrading (1 1 1)
    hex (173 174 194 193 253 254 274 273) fluid (4 4 25) simpleGrading (1 1 1)
    hex (174 175 195 194 254 255 275 274) fluid (8 4 25) simpleGrading (1 1 1)
    hex (175 176 196 195 255 256 276 275) fluid (4 4 25) simpleGrading (1 1 1)
    hex (176 177 197 196 256 257 277 276) fluid (8 4 25) simpleGrading (1 1 1)
    hex (177 178 198 197 257 258 278 277) fluid (4 4 25) simpleGrading (1 1 1)
    hex (178 179 199 198 258 259 279 278) fluid (4 4 25) simpleGrading (1 1 1)
    hex (180 181 201 200 260 261 281 280) fluid (4 18 25) simpleGrading (1 1 1)
    hex (181 182 202 201 261 262 282 281) fluid (4 18 25) simpleGrading (1 1 1)
    hex (182 183 203 202 262 263 283 282) fluid (8 18 25) simpleGrading (1 1 1)
    hex (183 184 204 203 263 264 284 283) fluid (4 18 25) simpleGrading (1 1 1)
    hex (184 185 205 204 264 265 285 284) fluid (8 18 25) simpleGrading (1 1 1)
    hex (185 186 206 205 265 266 286 285) fluid (4 18 25) simpleGrading (1 1 1)
    hex (186 187 207 206 266 267 287 286) fluid (8 18 25) simpleGrading (1 1 1)
    hex (187 188 208 207 267 268 288 287) fluid (4 18 25) simpleGrading (1 1 1)
    hex (188 189 209 208 268 269 289 288) fluid (8 18 25) simpleGrading (1 1 1)
    hex (189 190 210 209 269 270 290 289) fluid (4 18 25) simpleGrading (1 1 1)
    hex (190 191 211 210 270 271 291 290) fluid (8 18 25) simpleGrading (1 1 1)
    hex (191 192 212 211 271 272 292 291) fluid (4 18 25) simpleGrading (1 1 1)
    hex (192 193 213 212 272 273 293 292) fluid (8 18 25) simpleGrading (1 1 1)
    hex (193 194 214 213 273 274 294 293) fluid (4 18 25) simpleGrading (1 1 1)
    hex (194 195 215 214 274 275 295 294) fluid (8 18 25) simpleGrading (1 1 1)
    hex (195 196 216 215 275 276 296 295) fluid (4 18 25) simpleGrading (1 1 1)
    hex (196 197 217 216 276 277 297 296) fluid (8 18 25) simpleGrading (1 1 1)
    hex (197 198 218 217 277 278 298 297) fluid (4 18 25) simpleGrading (1 1 1)
    hex (198 199 219 218 278 279 299 298) fluid (4 18 25) simpleGrading (1 1 1)
    hex (200 201 221 220 280 281 301 300) fluid (4 12 25) simpleGrading (1 1 1)
    hex (201 202 222 221 281 282 302 301) fluid (4 12 25) simpleGrading (1 1 1)
    hex (202 203 223 222 282 283 303 302) fluid (8 12 25) simpleGrading (1 1 1)
    hex (203 204 224 223 283 284 304 303) fluid (4 12 25) simpleGrading (1 1 1)
    hex (204 205 225 224 284 285 305 304) fluid (8 12 25) simpleGrading (1 1 1)
    hex (205 206 226 225 285 286 306 305) fluid (4 12 25) simpleGrading (1 1 1)
    hex (206 207 227 226 286 287 307 306) fluid (8 12 25) simpleGrading (1 1 1)
    hex (207 208 228 227 287 288 308 307) fluid (4 12 25) simpleGrading (1 1 1)
    hex (208 209 229 228 288 289 309 308) fluid (8 12 25) simpleGrading (1 1 1)
    hex (209 210 230 229 289 290 310 309) fluid (4 12 25) simpleGrading (1 1 1)
    hex (210 211 231 230 290 291 311 310) fluid (8 12 25) simpleGrading (1 1 1)
    hex (211 212 232 231 291 292 312 311) fluid (4 12 25) simpleGrading (1 1 1)
    hex (212 213 233 232 292 293 313 312) fluid (8 12 25) simpleGrading (1 1 1)
    hex (213 214 234 233 293 294 314 313) fluid (4 12 25) simpleGrading (1 1 1)
    hex (214 215 235 234 294 295 315 314) fluid (8 12 25) simpleGrading (1 1 1)
    hex (215 216 236 235 295 296 316 315) fluid (4 12 25) simpleGrading (1 1 1)
    hex (216 217 237 236 296 297 317 316) fluid (8 12 25) simpleGrading (1 1 1)
    hex (217 218 238 237 297 298 318 317) fluid (4 12 25) simpleGrading (1 1 1)
    hex (218 219 239 238 298 299 319 318) fluid (4 12 25) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fan1_half0
    {
        type cyclic;
        neighbourPatch fan1_half1;
        faces
        (
        (0 20 21 1)
        (1 21 22 2)
        (2 22 23 3)
        (3 23 24 4)
        (4 24 25 5)
        (5 25 26 6)
        (6 26 27 7)
        (7 27 28 8)
        (8 28 29 9)
        (9 29 30 10)
        (10 30 31 11)
        (11 31 32 12)
        (12 32 33 13)
        (13 33 34 14)
        (14 34 35 15)
        (15 35 36 16)
        (16 36 37 17)
        (17 37 38 18)
        (18 38 39 19)
        (20 40 41 21)
        (21 41 42 22)
        (22 42 43 23)
        (23 43 44 24)
        (24 44 45 25)
        (25 45 46 26)
        (26 46 47 27)
        (27 47 48 28)
        (28 48 49 29)
        (29 49 50 30)
        (30 50 51 31)
        (31 51 52 32)
        (32 52 53 33)
        (33 53 54 34)
        (34 54 55 35)
        (35 55 56 36)
        (36 56 57 37)
        (37 57 58 38)
        (38 58 59 39)
        (40 60 61 41)
        (41 61 62 42)
        (42 62 63 43)
        (43 63 64 44)
        (44 64 65 45)
        (45 65 66 46)
        (46 66 67 47)
        (47 67 68 48)
        (48 68 69 49)
        (49 69 70 50)
        (50 70 71 51)
        (51 71 72 52)
        (52 72 73 53)
        (53 73 74 54)
        (54 74 75 55)
        (55 75 76 56)
        (56 76 77 57)
        (57 77 78 58)
        (58 78 79 59)
        );
    }
    fan1_half1
    {
        type cyclic;
        neighbourPatch fan1_half0;
        faces
        (
        (0 20 21 1)
        (1 21 22 2)
        (2 22 23 3)
        (3 23 24 4)
        (4 24 25 5)
        (5 25 26 6)
        (6 26 27 7)
        (7 27 28 8)
        (8 28 29 9)
        (9 29 30 10)
        (10 30 31 11)
        (11 31 32 12)
        (12 32 33 13)
        (13 33 34 14)
        (14 34 35 15)
        (15 35 36 16)
        (16 36 37 17)
        (17 37 38 18)
        (18 38 39 19)
        (20 40 41 21)
        (21 41 42 22)
        (22 42 43 23)
        (23 43 44 24)
        (24 44 45 25)
        (25 45 46 26)
        (26 46 47 27)
        (27 47 48 28)
        (28 48 49 29)
        (29 49 50 30)
        (30 50 51 31)
        (31 51 52 32)
        (32 52 53 33)
        (33 53 54 34)
        (34 54 55 35)
        (35 55 56 36)
        (36 56 57 37)
        (37 57 58 38)
        (38 58 59 39)
        (40 60 61 41)
        (41 61 62 42)
        (42 62 63 43)
        (43 63 64 44)
        (44 64 65 45)
        (45 65 66 46)
        (46 66 67 47)
        (47 67 68 48)
        (48 68 69 49)
        (49 69 70 50)
        (50 70 71 51)
        (51 71 72 52)
        (52 72 73 53)
        (53 73 74 54)
        (54 74 75 55)
        (55 75 76 56)
        (56 76 77 57)
        (57 77 78 58)
        (58 78 79 59)
        );
    }
    fan2_half0
    {
        type cyclic;
        neighbourPatch fan2_half1;
        faces
        (
        (240 241 261 260)
        (241 242 262 261)
        (242 243 263 262)
        (243 244 264 263)
        (244 245 265 264)
        (245 246 266 265)
        (246 247 267 266)
        (247 248 268 267)
        (248 249 269 268)
        (249 250 270 269)
        (250 251 271 270)
        (251 252 272 271)
        (252 253 273 272)
        (253 254 274 273)
        (254 255 275 274)
        (255 256 276 275)
        (256 257 277 276)
        (257 258 278 277)
        (258 259 279 278)
        (260 261 281 280)
        (261 262 282 281)
        (262 263 283 282)
        (263 264 284 283)
        (264 265 285 284)
        (265 266 286 285)
        (266 267 287 286)
        (267 268 288 287)
        (268 269 289 288)
        (269 270 290 289)
        (270 271 291 290)
        (271 272 292 291)
        (272 273 293 292)
        (273 274 294 293)
        (274 275 295 294)
        (275 276 296 295)
        (276 277 297 296)
        (277 278 298 297)
        (278 279 299 298)
        (280 281 301 300)
        (281 282 302 301)
        (282 283 303 302)
        (283 284 304 303)
        (284 285 305 304)
        (285 286 306 305)
        (286 287 307 306)
        (287 288 308 307)
        (288 289 309 308)
        (289 290 310 309)
        (290 291 311 310)
        (291 292 312 311)
        (292 293 313 312)
        (293 294 314 313)
        (294 295 315 314)
        (295 296 316 315)
        (296 297 317 316)
        (297 298 318 317)
        (298 299 319 318)
        );
    }
    fan2_half1
    {
        type cyclic;
        neighbourPatch fan2_half0;
        faces
        (
        (240 241 261 260)
        (241 242 262 261)
        (242 243 263 262)
        (243 244 264 263)
        (244 245 265 264)
        (245 246 266 265)
        (246 247 267 266)
        (247 248 268 267)
        (248 249 269 268)
        (249 250 270 269)
        (250 251 271 270)
        (251 252 272 271)
        (252 253 273 272)
        (253 254 274 273)
        (254 255 275 274)
        (255 256 276 275)
        (256 257 277 276)
        (257 258 278 277)
        (258 259 279 278)
        (260 261 281 280)
        (261 262 282 281)
        (262 263 283 282)
        (263 264 284 283)
        (264 265 285 284)
        (265 266 286 285)
        (266 267 287 286)
        (267 268 288 287)
        (268 269 289 288)
        (269 270 290 289)
        (270 271 291 290)
        (271 272 292 291)
        (272 273 293 292)
        (273 274 294 293)
        (274 275 295 294)
        (275 276 296 295)
        (276 277 297 296)
        (277 278 298 297)
        (278 279 299 298)
        (280 281 301 300)
        (281 282 302 301)
        (282 283 303 302)
        (283 284 304 303)
        (284 285 305 304)
        (285 286 306 305)
        (286 287 307 306)
        (287 288 308 307)
        (288 289 309 308)
        (289 290 310 309)
        (290 291 311 310)
        (291 292 312 311)
        (292 293 313 312)
        (293 294 314 313)
        (294 295 315 314)
        (295 296 316 315)
        (296 297 317 316)
        (297 298 318 317)
        (298 299 319 318)
        );
    }
    base_bottom
    {
        type wall;
        faces
        (
        (0 1 81 80)
        (1 2 82 81)
        (2 3 83 82)
        (3 4 84 83)
        (4 5 85 84)
        (5 6 86 85)
        (6 7 87 86)
        (7 8 88 87)
        (8 9 89 88)
        (9 10 90 89)
        (10 11 91 90)
        (11 12 92 91)
        (12 13 93 92)
        (13 14 94 93)
        (14 15 95 94)
        (15 16 96 95)
        (16 17 97 96)
        (17 18 98 97)
        (18 19 99 98)
        (80 81 161 160)
        (81 82 162 161)
        (82 83 163 162)
        (83 84 164 163)
        (84 85 165 164)
        (85 86 166 165)
        (86 87 167 166)
        (87 88 168 167)
        (88 89 169 168)
        (89 90 170 169)
        (90 91 171 170)
        (91 92 172 171)
        (92 93 173 172)
        (93 94 174 173)
        (94 95 175 174)
        (95 96 176 175)
        (96 97 177 176)
        (97 98 178 177)
        (98 99 179 178)
        (160 161 241 240)
        (161 162 242 241)
        (162 163 243 242)
        (163 164 244 243)
        (164 165 245 244)
        (165 166 246 245)
        (166 167 247 246)
        (167 168 248 247)
        (168 169 249 248)
        (169 170 250 249)
        (170 171 251 250)
        (171 172 252 251)
        (172 173 253 252)
        (173 174 254 253)
        (174 175 255 254)
        (175 176 256 255)
        (176 177 257 256)
        (177 178 258 257)
        (178 179 259 258)
        );
    }
    top_wall
    {
        type wall;
        faces
        (
        (60 140 141 61)
        (61 141 142 62)
        (62 142 143 63)
        (63 143 144 64)
        (64 144 145 65)
        (65 145 146 66)
        (66 146 147 67)
        (67 147 148 68)
        (68 148 149 69)
        (69 149 150 70)
        (70 150 151 71)
        (71 151 152 72)
        (72 152 153 73)
        (73 153 154 74)
        (74 154 155 75)
        (75 155 156 76)
        (76 156 157 77)
        (77 157 158 78)
        (78 158 159 79)
        (140 220 221 141)
        (141 221 222 142)
        (142 222 223 143)
        (143 223 224 144)
        (144 224 225 145)
        (145 225 226 146)
        (146 226 227 147)
        (147 227 228 148)
        (148 228 229 149)
        (149 229 230 150)
        (150 230 231 151)
        (151 231 232 152)
        (152 232 233 153)
        (153 233 234 154)
        (154 234 235 155)
        (155 235 236 156)
        (156 236 237 157)
        (157 237 238 158)
        (158 238 239 159)
        (220 300 301 221)
        (221 301 302 222)
        (222 302 303 223)
        (223 303 304 224)
        (224 304 305 225)
        (225 305 306 226)
        (226 306 307 227)
        (227 307 308 228)
        (228 308 309 229)
        (229 309 310 230)
        (230 310 311 231)
        (231 311 312 232)
        (232 312 313 233)
        (233 313 314 234)
        (234 314 315 235)
        (235 315 316 236)
        (236 316 317 237)
        (237 317 318 238)
        (238 318 319 239)
        );
    }
    side_walls
    {
        type wall;
        faces
        (
        (0 80 100 20)
        (19 39 119 99)
        (20 100 120 40)
        (39 59 139 119)
        (40 120 140 60)
        (59 79 159 139)
        (80 160 180 100)
        (99 119 199 179)
        (100 180 200 120)
        (119 139 219 199)
        (120 200 220 140)
        (139 159 239 219)
        (160 240 260 180)
        (179 199 279 259)
        (180 260 280 200)
        (199 219 299 279)
        (200 280 300 220)
        (219 239 319 299)
        );
    }
);

mergePatchPairs
(
);