Parametric Heatsink Simulation/Linux Files/pitch_8mm_nfins_9/constant/fluid/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      thermophysicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   28.9;       // Air, g/mol
    }
    thermodynamics
    {
        Cp          1005;       // J/(kg·K)
        Hf          0;
    }
    transport
    {
        mu          1.84e-5;    // Pa·s at ~300K
        Pr          0.713;
    }
}
