Parametric Heatsink Simulation/Linux Files/pitch_8mm_nfins_9/0/fluid/p_rgh
FoamFile
{
    version 2.0; format ascii;
    class volScalarField; location "0/fluid"; object p_rgh;
}
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    // Fan 1 — pushing flow in +Z direction into domain
    fan1_half0
    {
        type            fanPressureJump;
        patchType       cyclic;
        jump            uniform 0;
        value           uniform 0;
        jumpTable       polynomial
        (
            (73.9900  0)
            (-1164.2500  1)
            (-34615.0000  2)
        );
    }
    fan1_half1
    {
        type            fanPressureJump;
        patchType       cyclic;
        jump            uniform 0;
        value           uniform 0;
        jumpTable       polynomial
        (
            (73.9900  0)
            (-1164.2500  1)
            (-34615.0000  2)
        );
    }
    // Fan 2 — pulling flow out in +Z direction
    fan2_half0
    {
        type            fanPressureJump;
        patchType       cyclic;
        jump            uniform 0;
        value           uniform 0;
        jumpTable       polynomial
        (
            (73.9900  0)
            (-1164.2500  1)
            (-34615.0000  2)
        );
    }
    fan2_half1
    {
        type            fanPressureJump;
        patchType       cyclic;
        jump            uniform 0;
        value           uniform 0;
        jumpTable       polynomial
        (
            (73.9900  0)
            (-1164.2500  1)
            (-34615.0000  2)
        );
    }
    base_bottom  { type fixedFluxPressure; value uniform 0; }
    top_wall     { type fixedFluxPressure; value uniform 0; }
    side_walls   { type fixedFluxPressure; value uniform 0; }
    fluid_to_solid { type fixedFluxPressure; value uniform 0; }
}