Parametric Heatsink Simulation/Linux Files/pitch_8mm_nfins_9/0/fluid/alphat
FoamFile
{
    version 2.0; format ascii;
    class volScalarField; location "0/fluid"; object alphat;
}
dimensions [1 -1 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    fan1_half0   { type cyclic; }
    fan1_half1   { type cyclic; }
    fan2_half0   { type cyclic; }
    fan2_half1   { type cyclic; }
    base_bottom  { type compressible::alphatWallFunction; Prt 0.85; value uniform 0; }
    top_wall     { type compressible::alphatWallFunction; Prt 0.85; value uniform 0; }
    side_walls   { type compressible::alphatWallFunction; Prt 0.85; value uniform 0; }
    fluid_to_solid { type compressible::alphatWallFunction; Prt 0.85; value uniform 0; }
}