Parametric Heatsink Simulation/Linux Files/pitch_8mm_nfins_9/0/fluid/epsilon
FoamFile
{
    version 2.0; format ascii;
    class volScalarField; location "0/fluid"; object epsilon;
}
dimensions [0 2 -3 0 0 0 0];
internalField uniform 0.026;
boundaryField
{
    fan1_half0   { type cyclic; }
    fan1_half1   { type cyclic; }
    fan2_half0   { type cyclic; }
    fan2_half1   { type cyclic; }
    base_bottom  { type epsilonWallFunction; value uniform 0.026; }
    top_wall     { type epsilonWallFunction; value uniform 0.026; }
    side_walls   { type epsilonWallFunction; value uniform 0.026; }
    fluid_to_solid { type epsilonWallFunction; value uniform 0.026; }
}