Parametric Heatsink Simulation/Linux Files/pitch_8mm_nfins_9/system/solid/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/solid";
    object      fvSolution;
}

solvers
{
    h
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        h               1e-4;
    }
}

relaxationFactors
{
    equations
    {
        h               0.9;
    }
}
