Parametric Heatsink Simulation/Linux Files/pitch_8mm_nfins_9/system/solid/fvOptions
FoamFile
{
    version 2.0; format ascii;
    class dictionary; location "system/solid"; object fvOptions;
}
heatSource
{
    type            scalarSemiImplicitSource;
    active          true;
    selectionMode   all;
    scalarSemiImplicitSourceCoeffs
    {
        volumeMode  specific;
        injectionRateSuSp
        {
            h   (2.1490e+06 0);
        }
    }
}