Parametric Heatsink Simulation/Linux Files/pitch_8mm_nfins_9/system/splitMeshRegionsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      splitMeshRegionsDict;
}

// splitMeshRegions -cellZones -overwrite
// Produces regions named 'fluid' and 'solid' matching blockMeshDict zones
